sterentev/atdf-device-asm-include/inc/ATmega256RFR2.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	SCTSTRHH	= 0xFC		; [MEMORY MAPPED] Symbol Counter Transmit Frame Timestamp Register HH-Byte
.equ	SCTSTRHL	= 0xFB		; [MEMORY MAPPED] Symbol Counter Transmit Frame Timestamp Register HL-Byte
.equ	SCTSTRLH	= 0xFA		; [MEMORY MAPPED] Symbol Counter Transmit Frame Timestamp Register LH-Byte
.equ	SCTSTRLL	= 0xF9		; [MEMORY MAPPED] Symbol Counter Transmit Frame Timestamp Register LL-Byte
.equ	SCOCR1HH	= 0xF8		; [MEMORY MAPPED] Symbol Counter Output Compare Register 1 HH-Byte
.equ	SCOCR1HL	= 0xF7		; [MEMORY MAPPED] Symbol Counter Output Compare Register 1 HL-Byte
.equ	SCOCR1LH	= 0xF6		; [MEMORY MAPPED] Symbol Counter Output Compare Register 1 LH-Byte
.equ	SCOCR1LL	= 0xF5		; [MEMORY MAPPED] Symbol Counter Output Compare Register 1 LL-Byte
.equ	SCOCR2HH	= 0xF4		; [MEMORY MAPPED] Symbol Counter Output Compare Register 2 HH-Byte
.equ	SCOCR2HL	= 0xF3		; [MEMORY MAPPED] Symbol Counter Output Compare Register 2 HL-Byte
.equ	SCOCR2LH	= 0xF2		; [MEMORY MAPPED] Symbol Counter Output Compare Register 2 LH-Byte
.equ	SCOCR2LL	= 0xF1		; [MEMORY MAPPED] Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR3HH	= 0xF0		; [MEMORY MAPPED] Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HL	= 0xEF		; [MEMORY MAPPED] Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3LH	= 0xEE		; [MEMORY MAPPED] Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LL	= 0xED		; [MEMORY MAPPED] Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCTSRHH		= 0xEC		; [MEMORY MAPPED] Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHL		= 0xEB		; [MEMORY MAPPED] Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRLH		= 0xEA		; [MEMORY MAPPED] Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLL		= 0xE9		; [MEMORY MAPPED] Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCBTSRHH	= 0xE8		; [MEMORY MAPPED] Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHL	= 0xE7		; [MEMORY MAPPED] Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRLH	= 0xE6		; [MEMORY MAPPED] Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLL	= 0xE5		; [MEMORY MAPPED] Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCCNTHH		= 0xE4		; [MEMORY MAPPED] Symbol Counter Register HH-Byte
.equ	SCCNTHL		= 0xE3		; [MEMORY MAPPED] Symbol Counter Register HL-Byte
.equ	SCCNTLH		= 0xE2		; [MEMORY MAPPED] Symbol Counter Register LH-Byte
.equ	SCCNTLL		= 0xE1		; [MEMORY MAPPED] Symbol Counter Register LL-Byte
.equ	SCIRQS		= 0xE0		; [MEMORY MAPPED] Symbol Counter Interrupt Status Register
.equ	SCIRQM		= 0xDF		; [MEMORY MAPPED] Symbol Counter Interrupt Mask Register
.equ	SCSR		= 0xDE		; [MEMORY MAPPED] Symbol Counter Status Register
.equ	SCCR1		= 0xDD		; [MEMORY MAPPED] Symbol Counter Control Register 1
.equ	SCCR0		= 0xDC		; [MEMORY MAPPED] Symbol Counter Control Register 0
.equ	SCCSR		= 0xDB		; [MEMORY MAPPED] Symbol Counter Compare Source Register
.equ	SCRSTRHH	= 0xDA		; [MEMORY MAPPED] Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHL	= 0xD9		; [MEMORY MAPPED] Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRLH	= 0xD8		; [MEMORY MAPPED] Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLL	= 0xD7		; [MEMORY MAPPED] Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	UDR1		= 0xCE		; [MEMORY MAPPED] USART1 I/O Data Register
.equ	UBRR1		= 0xCC		; [MEMORY MAPPED] [___2 addrs___] USART1 Baud Rate Register  Bytes
.equ	UCSR1C		= 0xCA		; [MEMORY MAPPED] USART1 Control and Status Register C
.equ	UCSR1B		= 0xC9		; [MEMORY MAPPED] USART1 Control and Status Register B
.equ	UCSR1A		= 0xC8		; [MEMORY MAPPED] USART1 Control and Status Register A
.equ	UDR0		= 0xC6		; [MEMORY MAPPED] USART0 I/O Data Register
.equ	UBRR0		= 0xC4		; [MEMORY MAPPED] [___2 addrs___] USART0 Baud Rate Register  Bytes
.equ	UCSR0C		= 0xC2		; [MEMORY MAPPED] USART0 Control and Status Register C
.equ	UCSR0B		= 0xC1		; [MEMORY MAPPED] USART0 Control and Status Register B
.equ	UCSR0A		= 0xC0		; [MEMORY MAPPED] USART0 Control and Status Register A
.equ	IRQ_STATUS1	= 0xBF		; [MEMORY MAPPED] Transceiver Interrupt Status Register 1
.equ	IRQ_MASK1	= 0xBE		; [MEMORY MAPPED] Transceiver Interrupt Enable Register 1
.equ	TWAMR		= 0xBD		; [MEMORY MAPPED] TWI (Slave) Address Mask Register
.equ	TWCR		= 0xBC		; [MEMORY MAPPED] TWI Control Register
.equ	TWDR		= 0xBB		; [MEMORY MAPPED] TWI Data Register
.equ	TWAR		= 0xBA		; [MEMORY MAPPED] TWI (Slave) Address Register
.equ	TWSR		= 0xB9		; [MEMORY MAPPED] TWI Status Register
.equ	TWBR		= 0xB8		; [MEMORY MAPPED] TWI Bit Rate Register
.equ	ASSR		= 0xB6		; [MEMORY MAPPED] Asynchronous Status Register
.equ	OCR2B		= 0xB4		; [MEMORY MAPPED] Timer/Counter2 Output Compare Register B
.equ	OCR2A		= 0xB3		; [MEMORY MAPPED] Timer/Counter2 Output Compare Register A
.equ	TCNT2		= 0xB2		; [MEMORY MAPPED] Timer/Counter2
.equ	TCCR2B		= 0xB1		; [MEMORY MAPPED] Timer/Counter2 Control Register B
.equ	TCCR2A		= 0xB0		; [MEMORY MAPPED] Timer/Counter2 Control Register A
.equ	OCR4C		= 0xAC		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4 Output Compare Register C  Bytes
.equ	OCR4B		= 0xAA		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4 Output Compare Register B  Bytes
.equ	OCR4A		= 0xA8		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4 Output Compare Register A  Bytes
.equ	ICR4		= 0xA6		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4 Input Capture Register  Bytes
.equ	TCNT4		= 0xA4		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4  Bytes
.equ	TCCR4C		= 0xA2		; [MEMORY MAPPED] Timer/Counter4 Control Register C
.equ	TCCR4B		= 0xA1		; [MEMORY MAPPED] Timer/Counter4 Control Register B
.equ	TCCR4A		= 0xA0		; [MEMORY MAPPED] Timer/Counter4 Control Register A
.equ	OCR3C		= 0x9C		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output Compare Register C  Bytes
.equ	OCR3B		= 0x9A		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3A		= 0x98		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output Compare Register A  Bytes
.equ	ICR3		= 0x96		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Input Capture Register  Bytes
.equ	TCNT3		= 0x94		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3  Bytes
.equ	TCCR3C		= 0x92		; [MEMORY MAPPED] Timer/Counter3 Control Register C
.equ	TCCR3B		= 0x91		; [MEMORY MAPPED] Timer/Counter3 Control Register B
.equ	TCCR3A		= 0x90		; [MEMORY MAPPED] Timer/Counter3 Control Register A
.equ	OCR1C		= 0x8C		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Output Compare Register C  Bytes
.equ	OCR1B		= 0x8A		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Output Compare Register B  Bytes
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Output Compare Register A  Bytes
.equ	ICR1		= 0x86		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Input Capture Register  Bytes
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1  Bytes
.equ	TCCR1C		= 0x82		; [MEMORY MAPPED] Timer/Counter1 Control Register C
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter1 Control Register A
.equ	DIDR1		= 0x7F		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	DIDR2		= 0x7D		; [MEMORY MAPPED] Digital Input Disable Register 2
.equ	ADMUX		= 0x7C		; [MEMORY MAPPED] The ADC Multiplexer Selection Register
.equ	ADCSRB		= 0x7B		; [MEMORY MAPPED] ADC Control and Status Register B
.equ	ADCSRA		= 0x7A		; [MEMORY MAPPED] The ADC Control and Status Register A
.equ	ADC		= 0x78		; [MEMORY MAPPED] [___2 addrs___] ADC Data Register  Bytes
.equ	ADCSRC		= 0x77		; [MEMORY MAPPED] The ADC Control and Status Register C
.equ	NEMCR		= 0x75		; [MEMORY MAPPED] Flash Extended-Mode Control-Register
.equ	TIMSK5		= 0x73		; [MEMORY MAPPED] Timer/Counter5 Interrupt Mask Register
.equ	TIMSK4		= 0x72		; [MEMORY MAPPED] Timer/Counter4 Interrupt Mask Register
.equ	TIMSK3		= 0x71		; [MEMORY MAPPED] Timer/Counter3 Interrupt Mask Register
.equ	TIMSK2		= 0x70		; [MEMORY MAPPED] Timer/Counter Interrupt Mask register
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter1 Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter0 Interrupt Mask Register
.equ	PCMSK2		= 0x6D		; [MEMORY MAPPED] Pin Change Mask Register 2
.equ	PCMSK1		= 0x6C		; [MEMORY MAPPED] Pin Change Mask Register 1
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Mask Register 0
.equ	EICRB		= 0x6A		; [MEMORY MAPPED] External Interrupt Control Register B
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register A
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	BGCR		= 0x67		; [MEMORY MAPPED] Reference Voltage Calibration Register
.equ	OSCCAL		= 0x66		; [MEMORY MAPPED] Oscillator Calibration Value
.equ	PRR1		= 0x65		; [MEMORY MAPPED] Power Reduction Register 1
.equ	PRR0		= 0x64		; [MEMORY MAPPED] Power Reduction Register0
.equ	PRR2		= 0x63		; [MEMORY MAPPED] Power Reduction Register 2
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] Clock Prescale Register
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; [___2 addrs___] Stack Pointer 
.equ	EIND		= 0x3C		; Extended Indirect Register
.equ	RAMPZ		= 0x3B		; Extended Z-pointer Register for ELPM/SPM
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	OCDR		= 0x31		; On-Chip Debug Register
.equ	ACSR		= 0x30		; Analog Comparator Control And Status Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	GPIOR2		= 0x2B		; General Purpose I/O Register 2
.equ	GPIOR1		= 0x2A		; General Purpose IO Register 1
.equ	OCR0B		= 0x28		; Timer/Counter0 Output Compare Register B
.equ	OCR0A		= 0x27		; Timer/Counter0 Output Compare Register
.equ	TCNT0		= 0x26		; Timer/Counter0 Register
.equ	TCCR0B		= 0x25		; Timer/Counter0 Control Register B
.equ	TCCR0A		= 0x24		; Timer/Counter0 Control Register A
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; [___2 addrs___] EEPROM Address Register  Bytes
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	TIFR5		= 0x1A		; Timer/Counter5 Interrupt Flag Register
.equ	TIFR4		= 0x19		; Timer/Counter4 Interrupt Flag Register
.equ	TIFR3		= 0x18		; Timer/Counter3 Interrupt Flag Register
.equ	TIFR2		= 0x17		; Timer/Counter Interrupt Flag Register
.equ	TIFR1		= 0x16		; Timer/Counter1 Interrupt Flag Register
.equ	TIFR0		= 0x15		; Timer/Counter0 Interrupt Flag Register
.equ	PORTG		= 0x14		; Port G Data Register
.equ	DDRG		= 0x13		; Port G Data Direction Register
.equ	PING		= 0x12		; Port G Input Pins Address
.equ	PORTF		= 0x11		; Port F Data Register
.equ	DDRF		= 0x10		; Port F Data Direction Register
.equ	PINF		= 0x0F		; Port F Input Pins Address
.equ	PORTE		= 0x0E		; Port E Data Register
.equ	DDRE		= 0x0D		; Port E Data Direction Register
.equ	PINE		= 0x0C		; Port E Input Pins Address
.equ	PORTD		= 0x0B		; Port D Data Register
.equ	DDRD		= 0x0A		; Port D Data Direction Register
.equ	PIND		= 0x09		; Port D Input Pins Address
.equ	PORTC		= 0x08		; Port C Data Register
.equ	DDRC		= 0x07		; Port C Data Direction Register
.equ	PINC		= 0x06		; Port C Input Pins Address
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins Address
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Port A Data Direction Register
.equ	PINA		= 0x00		; Port A Input Pins Address
.equ	TRXFBEND	= 0x01FF	; [MEMORY MAPPED] End of frame buffer
.equ	TRXFBST		= 0x0180	; [MEMORY MAPPED] Start of frame buffer
.equ	TST_RX_LENGTH	= 0x017B	; [MEMORY MAPPED] Transceiver Received Frame Length Register
.equ	TST_CTRL_DIGI	= 0x0176	; [MEMORY MAPPED] Transceiver Digital Test Control Register
.equ	CSMA_BE		= 0x016F	; [MEMORY MAPPED] Transceiver CSMA-CA Back-off Exponent Control Register
.equ	CSMA_SEED_1	= 0x016E	; [MEMORY MAPPED] Transceiver Acknowledgment Frame Control Register 2
.equ	CSMA_SEED_0	= 0x016D	; [MEMORY MAPPED] Transceiver CSMA-CA Random Number Generator Seed Register
.equ	XAH_CTRL_0	= 0x016C	; [MEMORY MAPPED] Transceiver Extended Operating Mode Control Register
.equ	IEEE_ADDR_7	= 0x016B	; [MEMORY MAPPED] Transceiver MAC IEEE Address Register 7
.equ	IEEE_ADDR_6	= 0x016A	; [MEMORY MAPPED] Transceiver MAC IEEE Address Register 6
.equ	IEEE_ADDR_5	= 0x0169	; [MEMORY MAPPED] Transceiver MAC IEEE Address Register 5
.equ	IEEE_ADDR_4	= 0x0168	; [MEMORY MAPPED] Transceiver MAC IEEE Address Register 4
.equ	IEEE_ADDR_3	= 0x0167	; [MEMORY MAPPED] Transceiver MAC IEEE Address Register 3
.equ	IEEE_ADDR_2	= 0x0166	; [MEMORY MAPPED] Transceiver MAC IEEE Address Register 2
.equ	IEEE_ADDR_1	= 0x0165	; [MEMORY MAPPED] Transceiver MAC IEEE Address Register 1
.equ	IEEE_ADDR_0	= 0x0164	; [MEMORY MAPPED] Transceiver MAC IEEE Address Register 0
.equ	PAN_ID_1	= 0x0163	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register (High Byte)
.equ	PAN_ID_0	= 0x0162	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register (Low Byte)
.equ	SHORT_ADDR_1	= 0x0161	; [MEMORY MAPPED] Transceiver MAC Short Address Register (High Byte)
.equ	SHORT_ADDR_0	= 0x0160	; [MEMORY MAPPED] Transceiver MAC Short Address Register (Low Byte)
.equ	MAN_ID_1	= 0x015F	; [MEMORY MAPPED] Device Identification Register (Manufacture ID High Byte)
.equ	MAN_ID_0	= 0x015E	; [MEMORY MAPPED] Device Identification Register (Manufacture ID Low Byte)
.equ	VERSION_NUM	= 0x015D	; [MEMORY MAPPED] Device Identification Register (Version Number)
.equ	PART_NUM	= 0x015C	; [MEMORY MAPPED] Device Identification Register (Part Number)
.equ	PLL_DCU		= 0x015B	; [MEMORY MAPPED] Transceiver Delay Cell Calibration Control Register
.equ	PLL_CF		= 0x015A	; [MEMORY MAPPED] Transceiver Center Frequency Calibration Control Register
.equ	FTN_CTRL	= 0x0158	; [MEMORY MAPPED] Transceiver Filter Tuning Control Register
.equ	XAH_CTRL_1	= 0x0157	; [MEMORY MAPPED] Transceiver Acknowledgment Frame Control Register 1
.equ	TRX_RPC		= 0x0156	; [MEMORY MAPPED] Transceiver Reduced Power Consumption Control
.equ	RX_SYN		= 0x0155	; [MEMORY MAPPED] Transceiver Receiver Sensitivity Control Register
.equ	CC_CTRL_1	= 0x0154	; [MEMORY MAPPED] Channel Control Register 1
.equ	CC_CTRL_0	= 0x0153	; [MEMORY MAPPED] Channel Control Register 0
.equ	XOSC_CTRL	= 0x0152	; [MEMORY MAPPED] Crystal Oscillator Control Register
.equ	BATMON		= 0x0151	; [MEMORY MAPPED] Battery Monitor Control and Status Register
.equ	VREG_CTRL	= 0x0150	; [MEMORY MAPPED] Voltage Regulator Control and Status Register
.equ	IRQ_STATUS	= 0x014F	; [MEMORY MAPPED] Transceiver Interrupt Status Register
.equ	IRQ_MASK	= 0x014E	; [MEMORY MAPPED] Transceiver Interrupt Enable Register
.equ	ANT_DIV		= 0x014D	; [MEMORY MAPPED] Antenna Diversity Control Register
.equ	TRX_CTRL_2	= 0x014C	; [MEMORY MAPPED] Transceiver Control Register 2
.equ	SFD_VALUE	= 0x014B	; [MEMORY MAPPED] Start of Frame Delimiter Value Register
.equ	RX_CTRL		= 0x014A	; [MEMORY MAPPED] Transceiver Receive Control Register
.equ	CCA_THRES	= 0x0149	; [MEMORY MAPPED] Transceiver CCA Threshold Setting Register
.equ	PHY_CC_CCA	= 0x0148	; [MEMORY MAPPED] Transceiver Clear Channel Assessment (CCA) Control Register
.equ	PHY_ED_LEVEL	= 0x0147	; [MEMORY MAPPED] Transceiver Energy Detection Level Register
.equ	PHY_RSSI	= 0x0146	; [MEMORY MAPPED] Receiver Signal Strength Indicator Register
.equ	PHY_TX_PWR	= 0x0145	; [MEMORY MAPPED] Transceiver Transmit Power Control Register
.equ	TRX_CTRL_1	= 0x0144	; [MEMORY MAPPED] Transceiver Control Register 1
.equ	TRX_CTRL_0	= 0x0143	; [MEMORY MAPPED] Reserved
.equ	TRX_STATE	= 0x0142	; [MEMORY MAPPED] Transceiver State Control Register
.equ	TRX_STATUS	= 0x0141	; [MEMORY MAPPED] Transceiver Status Register
.equ	AES_KEY		= 0x013F	; [MEMORY MAPPED] AES Encryption and Decryption Key Buffer Register
.equ	AES_STATE	= 0x013E	; [MEMORY MAPPED] AES Plain and Cipher Text Buffer Register
.equ	AES_STATUS	= 0x013D	; [MEMORY MAPPED] AES Status Register
.equ	AES_CTRL	= 0x013C	; [MEMORY MAPPED] AES Control Register
.equ	TRXPR		= 0x0139	; [MEMORY MAPPED] Transceiver Pin Register
.equ	PARCR		= 0x0138	; [MEMORY MAPPED] Power Amplifier Ramp up/down Control Register
.equ	DPDS1		= 0x0137	; [MEMORY MAPPED] Port Driver Strength Register 1
.equ	DPDS0		= 0x0136	; [MEMORY MAPPED] Port Driver Strength Register 0
.equ	DRTRAM0		= 0x0135	; [MEMORY MAPPED] Data Retention Configuration Register #0
.equ	DRTRAM1		= 0x0134	; [MEMORY MAPPED] Data Retention Configuration Register #1
.equ	DRTRAM2		= 0x0133	; [MEMORY MAPPED] Data Retention Configuration Register #2
.equ	DRTRAM3		= 0x0132	; [MEMORY MAPPED] Data Retention Configuration Register #3
.equ	LLDRH		= 0x0131	; [MEMORY MAPPED] Low Leakage Voltage Regulator Data Register (High-Byte)
.equ	LLDRL		= 0x0130	; [MEMORY MAPPED] Low Leakage Voltage Regulator Data Register (Low-Byte)
.equ	LLCR		= 0x012F	; [MEMORY MAPPED] Low Leakage Voltage Regulator Control Register
.equ	OCR5C		= 0x012C	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5 Output Compare Register C  Bytes
.equ	OCR5B		= 0x012A	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5 Output Compare Register B  Bytes
.equ	OCR5A		= 0x0128	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5 Output Compare Register A  Bytes
.equ	ICR5		= 0x0126	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5 Input Capture Register  Bytes
.equ	TCNT5		= 0x0124	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5  Bytes
.equ	TCCR5C		= 0x0122	; [MEMORY MAPPED] Timer/Counter5 Control Register C
.equ	TCCR5B		= 0x0121	; [MEMORY MAPPED] Timer/Counter5 Control Register B
.equ	TCCR5A		= 0x0120	; [MEMORY MAPPED] Timer/Counter5 Control Register A
.equ	MAFPA3H		= 0x011D	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register for Frame Filter 3 (High Byte)
.equ	MAFPA3L		= 0x011C	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register for Frame Filter 3 (Low Byte)
.equ	MAFSA3H		= 0x011B	; [MEMORY MAPPED] Transceiver MAC Short Address Register for Frame Filter 3 (High Byte)
.equ	MAFSA3L		= 0x011A	; [MEMORY MAPPED] Transceiver MAC Short Address Register for Frame Filter 3 (Low Byte)
.equ	MAFPA2H		= 0x0119	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register for Frame Filter 2 (High Byte)
.equ	MAFPA2L		= 0x0118	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register for Frame Filter 2 (Low Byte)
.equ	MAFSA2H		= 0x0117	; [MEMORY MAPPED] Transceiver MAC Short Address Register for Frame Filter 2 (High Byte)
.equ	MAFSA2L		= 0x0116	; [MEMORY MAPPED] Transceiver MAC Short Address Register for Frame Filter 2 (Low Byte)
.equ	MAFPA1H		= 0x0115	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register for Frame Filter 1 (High Byte)
.equ	MAFPA1L		= 0x0114	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register for Frame Filter 1 (Low Byte)
.equ	MAFSA1H		= 0x0113	; [MEMORY MAPPED] Transceiver MAC Short Address Register for Frame Filter 1 (High Byte)
.equ	MAFSA1L		= 0x0112	; [MEMORY MAPPED] Transceiver MAC Short Address Register for Frame Filter 1 (Low Byte)
.equ	MAFPA0H		= 0x0111	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register for Frame Filter 0 (High Byte)
.equ	MAFPA0L		= 0x0110	; [MEMORY MAPPED] Transceiver Personal Area Network ID Register for Frame Filter 0 (Low Byte)
.equ	MAFSA0H		= 0x010F	; [MEMORY MAPPED] Transceiver MAC Short Address Register for Frame Filter 0 (High Byte)
.equ	MAFSA0L		= 0x010E	; [MEMORY MAPPED] Transceiver MAC Short Address Register for Frame Filter 0 (Low Byte)
.equ	MAFCR1		= 0x010D	; [MEMORY MAPPED] Multiple Address Filter Configuration Register 1
.equ	MAFCR0		= 0x010C	; [MEMORY MAPPED] Multiple Address Filter Configuration Register 0
;
; ----------	REGISTERS PAIRS			------------------------
;    USART1 Baud Rate Register  Bytes
.equ	UBRR1H		= 0xCD
.equ	UBRR1L		= 0xCC
;    USART0 Baud Rate Register  Bytes
.equ	UBRR0H		= 0xC5
.equ	UBRR0L		= 0xC4
;    Timer/Counter4 Output Compare Register C  Bytes
.equ	OCR4CH		= 0xAD
.equ	OCR4CL		= 0xAC
;    Timer/Counter4 Output Compare Register B  Bytes
.equ	OCR4BH		= 0xAB
.equ	OCR4BL		= 0xAA
;    Timer/Counter4 Output Compare Register A  Bytes
.equ	OCR4AH		= 0xA9
.equ	OCR4AL		= 0xA8
;    Timer/Counter4 Input Capture Register  Bytes
.equ	ICR4H		= 0xA7
.equ	ICR4L		= 0xA6
;    Timer/Counter4  Bytes
.equ	TCNT4H		= 0xA5
.equ	TCNT4L		= 0xA4
;    Timer/Counter3 Output Compare Register C  Bytes
.equ	OCR3CH		= 0x9D
.equ	OCR3CL		= 0x9C
;    Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3BH		= 0x9B
.equ	OCR3BL		= 0x9A
;    Timer/Counter3 Output Compare Register A  Bytes
.equ	OCR3AH		= 0x99
.equ	OCR3AL		= 0x98
;    Timer/Counter3 Input Capture Register  Bytes
.equ	ICR3H		= 0x97
.equ	ICR3L		= 0x96
;    Timer/Counter3  Bytes
.equ	TCNT3H		= 0x95
.equ	TCNT3L		= 0x94
;    Timer/Counter1 Output Compare Register C  Bytes
.equ	OCR1CH		= 0x8D
.equ	OCR1CL		= 0x8C
;    Timer/Counter1 Output Compare Register B  Bytes
.equ	OCR1BH		= 0x8B
.equ	OCR1BL		= 0x8A
;    Timer/Counter1 Output Compare Register A  Bytes
.equ	OCR1AH		= 0x89
.equ	OCR1AL		= 0x88
;    Timer/Counter1 Input Capture Register  Bytes
.equ	ICR1H		= 0x87
.equ	ICR1L		= 0x86
;    Timer/Counter1  Bytes
.equ	TCNT1H		= 0x85
.equ	TCNT1L		= 0x84
;    ADC Data Register  Bytes
.equ	ADCH		= 0x79
.equ	ADCL		= 0x78
;    Stack Pointer 
.equ	SPH		= 0x3E
.equ	SPL		= 0x3D
;    EEPROM Address Register  Bytes
.equ	EEARH		= 0x22
.equ	EEARL		= 0x21
;    Timer/Counter5 Output Compare Register C  Bytes
.equ	OCR5CH		= 0x012D
.equ	OCR5CL		= 0x012C
;    Timer/Counter5 Output Compare Register B  Bytes
.equ	OCR5BH		= 0x012B
.equ	OCR5BL		= 0x012A
;    Timer/Counter5 Output Compare Register A  Bytes
.equ	OCR5AH		= 0x0129
.equ	OCR5AL		= 0x0128
;    Timer/Counter5 Input Capture Register  Bytes
.equ	ICR5H		= 0x0127
.equ	ICR5L		= 0x0126
;    Timer/Counter5  Bytes
.equ	TCNT5H		= 0x0125
.equ	TCNT5L		= 0x0124


; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADCSRB bits		------------------------
.equ	ACME		= 6		; 0x40 - Analog Comparator Multiplexer Enable

