sterentev/atdf-device-asm-include/inc/ATmega256RFR2.inc
; ----------	Register ACSR bits		------------------------
.equ	ACD		= 7		; 0x80 - Analog Comparator Disable
.equ	ACBG		= 6		; 0x40 - Analog Comparator Bandgap Select
.equ	ACO		= 5		; 0x20 - Analog Compare Output
.equ	ACI		= 4		; 0x10 - Analog Comparator Interrupt Flag
.equ	ACIE		= 3		; 0x08 - Analog Comparator Interrupt Enable
.equ	ACIC		= 2		; 0x04 - Analog Comparator Input Capture Enable
.equ	ACIS_MASK	= 0x03		;      - Analog Comparator Interrupt Mode Select (2 bits)
.equ	ACIS0		= 0		;          ACIS BIT0 position
; ::::  ACIS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge

; ----------	Register DIDR1 bits		------------------------
.equ	AIN1D		= 1		; 0x02 - AIN1 Digital Input Disable
.equ	AIN0D		= 0		; 0x01 - AIN0 Digital Input Disable



; ====	USART MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register UCSR0A bits		------------------------
.equ	RXC0		= 7		; 0x80 - USART Receive Complete
.equ	TXC0		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE0		= 5		; 0x20 - USART Data Register Empty
.equ	FE0		= 4		; 0x10 - Frame Error
.equ	DOR0		= 3		; 0x08 - Data overRun
.equ	UPE0		= 2		; 0x04 - USART Parity Error
.equ	U2X0		= 1		; 0x02 - Double the USART Transmission Speed
.equ	MPCM0		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR0B bits		------------------------
.equ	RXCIE0		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE0		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE0		= 5		; 0x20 - USART Data Register Empty Interrupt Enable
.equ	RXEN0		= 4		; 0x10 - Receiver Enable
.equ	TXEN0		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ02		= 2		; 0x04 - Character Size
.equ	RXB80		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB80		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR0C bits		------------------------
.equ	UMSEL0_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL00		= 6		;          UMSEL0 BIT0 position
.equ	UPM0_MASK	= 0x30		;      - Parity Mode (2 bits)
.equ	UPM00		= 4		;          UPM0 BIT0 position
.equ	USBS0		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ0_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ00		= 1		;          UCSZ0 BIT0 position
.equ	UCPOL0		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL0	:::: bitfield values
;			0x00		; Asynchronous USART
;			0x40		; Synchronous USART
;			0x80		; Reserved
;			0xC0		; Master SPI (MSPIM)
; ::::  UPM0	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS0	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit
; ::::  UCSZ0	>>>> This is a part of USART_CHAR_SIZE_BITF enum (see complete values list below)
; ::::  UCPOL0	:::: bitfield values
;			0x00		; Rising XCKn Edge (Transmitted Data Changed), Falling XCKn Edge (Received Data Sampled)
;			0x01		; Falling XCKn Edge (Transmitted Data Changed), Rising XCKn Edge (Received Data Sampled)

; ----------	Register UCSR1A bits		------------------------
.equ	RXC1		= 7		; 0x80 - USART Receive Complete
.equ	TXC1		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE1		= 5		; 0x20 - USART Data Register Empty
.equ	FE1		= 4		; 0x10 - Frame Error
.equ	DOR1		= 3		; 0x08 - Data OverRun
.equ	UPE1		= 2		; 0x04 - USART Parity Error
.equ	U2X1		= 1		; 0x02 - Double the USART Transmission Speed
.equ	MPCM1		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR1B bits		------------------------
.equ	RXCIE1		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE1		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE1		= 5		; 0x20 - USART Data Register Empty Interrupt Enable
.equ	RXEN1		= 4		; 0x10 - Receiver Enable
.equ	TXEN1		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ12		= 2		; 0x04 - Character Size
.equ	RXB81		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB81		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR1C bits		------------------------
.equ	UMSEL1_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL10		= 6		;          UMSEL1 BIT0 position
.equ	UPM1_MASK	= 0x30		;      - Parity Mode (2 bits)
.equ	UPM10		= 4		;          UPM1 BIT0 position
.equ	USBS1		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ1_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ10		= 1		;          UCSZ1 BIT0 position
.equ	UCPOL1		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL1	:::: bitfield values
;			0x00		; Asynchronous USART
;			0x40		; Synchronous USART
;			0x80		; Reserved
;			0xC0		; Master SPI (MSPIM)
; ::::  UPM1	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS1	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit
; ::::  UCSZ1	>>>> This is a part of USART_CHAR_SIZE_BITF enum (see complete values list below)
; ::::  UCPOL1	:::: bitfield values
;			0x00		; Rising XCKn Edge (Transmitted Data Changed), Falling XCKn Edge (Received Data Sampled)
;			0x01		; Falling XCKn Edge (Transmitted Data Changed), Rising XCKn Edge (Received Data Sampled)



; ====	TWI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TWAMR bits		------------------------
.equ	TWAM_MASK	= 0xFE		;      - TWI Address Mask (7 bits)
.equ	TWAM0		= 1		;          TWAM BIT0 position
.equ	TWAMR_Res	= 0		; 0x01 - Reserved Bit

; ----------	Register TWCR bits		------------------------
.equ	TWINT		= 7		; 0x80 - TWI Interrupt Flag
.equ	TWEA		= 6		; 0x40 - TWI Enable Acknowledge Bit
.equ	TWSTA		= 5		; 0x20 - TWI START Condition Bit
.equ	TWSTO		= 4		; 0x10 - TWI STOP Condition Bit
.equ	TWWC		= 3		; 0x08 - TWI Write Collision Flag
.equ	TWEN		= 2		; 0x04 - TWI Enable Bit
.equ	TWCR_Res	= 1		; 0x02 - Reserved Bit
.equ	TWIE		= 0		; 0x01 - TWI Interrupt Enable

; ----------	Register TWSR bits		------------------------
.equ	TWS_MASK	= 0xF8		;      - TWI Status (5 bits)
.equ	TWS0		= 3		;          TWS BIT0 position
.equ	TWSR_Res	= 2		; 0x04 - Reserved Bit
.equ	TWPS_MASK	= 0x03		;      - TWI Prescaler Bits (2 bits)
.equ	TWPS0		= 0		;          TWPS BIT0 position
; ::::  TWS	:::: bitfield values
;			0x00		; Bus error due to illegal START or STOP condition.
;			0x08		; A START condition has been transmitted.
;			0x10		; A repeated START condition has been transmitted.
;			0x18		; SLA+W has been transmitted; ACK has been received.
;			0x20		; SLA+W has been transmitted; NOT ACK has been received.
;			0x28		; Data byte has been transmitted; ACK has been received.
;			0x30		; Data byte has been transmitted; NOT ACK has been received.
;			0x38		; Arbitration lost in SLA+W or data bytes (Transmitter); Arbitration lost in SLA+R or NOT ACK bit (Receiver).
;			0x40		; SLA+R has been transmitted; ACK has been received.
;			0x48		; SLA+R has been transmitted; NOT ACK has been received.
;			0x50		; Data byte has been received; ACK has been returned.
;			0x58		; Data byte has been received; NOT ACK has been returned.
;			0x60		; Own SLA+W has been received; ACK has been returned.
;			0x68		; Arbitration lost in SLA+R/W as Master; own SLA+W has been received; ACK has been returned.
;			0x70		; General call address has been received; ACK has been returned.
;			0x78		; Arbitration lost in SLA+R/W as Master; general call address has been received; ACK has been returned.
;			0x80		; Previously addressed with own SLA+W; data has been received; ACK has been returned.
;			0x88		; Previously addressed with own SLA+W; data has been received; NOT ACK has been returned.
;			0x90		; Previously addressed with general call; data has been received; ACK has been returned.
;			0x98		; Previously addressed with general call; data has been received; NOT ACK has been returned.
;			0xA0		; A STOP condition or repeated START condition has been received while still addressed as Slave.
;			0xA8		; Own SLA+R has been received; ACK has been returned.
;			0xB0		; Arbitration lost in SLA+R/W as Master; own SLA+R has been received; ACK has been returned.
;			0xB8		; Data byte in TWDR has been transmitted; ACK has been received.
;			0xC0		; Data byte in TWDR has been transmitted; NO ACK has been received.
;			0xC8		; Last data byte in TWDR has been transmitted (TWEA = 0); ACK has been received.
;			0xF8		; No relevant state information available; TWINT = 0.
; ::::  TWPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 4
;			0x02		; 16
;			0x03		; 64

; ----------	Register TWAR bits		------------------------
.equ	TWA_MASK	= 0xFE		;      - TWI (Slave) Address (7 bits)
.equ	TWA0		= 1		;          TWA BIT0 position
.equ	TWGCE		= 0		; 0x01 - TWI General Call Recognition Enable Bit



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Select 1 and 0 (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  CPOL	:::: bitfield values
;			0x00		; Rising (Leading Edge), Falling (Trailing Edge)
;			0x08		; Falling (Leading Edge), Rising (Trailing Edge)
; ::::  CPHA	:::: bitfield values
;			0x00		; Sample (Leading Edge), Setup (Trailing Edge)
;			0x04		; Setup (Leading Edge), Sample (Trailing Edge)
; ::::  SPR	:::: bitfield values
;			0x00		; fosc/4 / fosc/2 (SPI2X=0/1)
;			0x01		; fosc/16 / fosc/8 (SPI2X=0/1)
;			0x02		; fosc/64 / fosc/32 (SPI2X=0/1)
;			0x03		; fosc/128 / fosc/64 (SPI2X=0/1)

